app/controllers/messages_controller.rb

INSERT INTO "messages" ("created_at", "lat", "long", "msg", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create_mobile
        @message = Message.new(ActiveSupport::JSON.decode(request.body.string)) if session[:user_id]
        @message.save

INSERT INTO "messages" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 10 Jan 2014 00:34:55 UTC +00:00], ["updated_at", Fri, 10 Jan 2014 00:34:55 UTC +00:00]]
---
  def create
        @message = Message.new(message_params)
        @message.save

SELECT "messages".* FROM "messages" WHERE ((
---
  def find
        #This should come with a radius, lat, long. Output: all points within R miles of lat/long.
        r = params[:r]
        lat = params[:lat]
        long = params[:long]
        @message = Message.within(r, :origin => [lat, long]).all